<a href="https://colab.research.google.com/github/LaimengEung/inf-604-data-analysis-i-repo/blob/master/Copy_of_Lab1_Introduction_final.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Lab1: Introduction to Data Analysis**

**Course**: **INF-604: Data Analysis** <br>
**Lecturer**: **Sothea HAS, PhD**

-----

**Objective:**  You have already seen some elements of Data Analysis in the course. In this lab, we will take our first step into working with the main element of Data Analysis, which is the dataset. By the end of this lab, you will be able to import data into a Jupyter Notebook and perform some data manipulation.

- Or you can work directly with `Google Colab` here: [Lab1_Introduction.ipynb](https://colab.research.google.com/drive/14L1fgW35_yZAW3BIsG-oGLxBO0lXANMO?usp=sharing).

-----

- `Student's name:` Laimeng Eung
- `Year:` 3
- `Major:` ICT
-----

## **1. Data for Your Business**

Imagine you want to start your own business, such as a coffee shop or a bookstore. What types of data do you think you need to gather to determine the potential success of your business? Here are some questions to help you think and answer this question:

- What is your plan for the business?

- What information might you need to collect?

- Would you likely collect those infornation as numbers or class/types?

- How large the sample size should be?

- After being collected, what do you think might be the problem with the data?

`Answer:`

---------

* I want to...

## **2. Importing Some Data**


There are many online data sources that you can explore, and one of the most popular is [`Kaggle`](https://www.kaggle.com/datasets/). In addition to datasets, `Kaggle` also hosts data competitions with prizes and offers courses to help you advance in data learning.


Here, we start our journey by exploring a dataset that you probably have heard its name before: [`Titanic`](https://www.kaggle.com/c/titanic/data/). You can download it from `Kaggle` using the following codes.

In [1]:
# %pip install kagglehub

import kagglehub

# Download latest version
path = kagglehub.dataset_download("yasserh/titanic-dataset")

# Pandas module allows you to import the data
import pandas as pd
data = pd.read_csv(path+'/Titanic-Dataset.csv')
data.head()

Using Colab cache for faster access to the 'titanic-dataset' dataset.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
# I want to import the data.
%ls {path}

path

Titanic-Dataset.csv

'/kaggle/input/titanic-dataset'

In [3]:
# Loading the dataset
import pandas as pd # pandas is the bos to work with data

data = pd.read_csv(path + '/Titanic-Dataset.csv')

data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

-------

### **2.1. Overview of the data**


Answer the following questions:

**A.** How many rows and columns are there in this dataset?

**B.** Explain the meaning of each column.

**C.** Are there any missing values in this dataset? If so, how many rows contain at least one missing value?

- What should you do with column `Cabin`?

- How would you drop rows with at least one missing value?


------------------

In [4]:
# To do
# To do
# A. How many rows and columns?
data.shape

rows = len(data)
columns = len(data.columns)

print(f"There are {rows} rows")
print(f"There are {columns} columns")

There are 891 rows
There are 12 columns

In [5]:
# B. Explain the meaning of each column:
print("\nThe columns are:")
for col in data.columns:
    print(col)

The columns are:
PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

**B.** Explain the meaning of each column:

* PassengerId: passenger ID
* Survived: binary column (0 or 1) of Survival, 0 = No, 1 = Yes
* Pclass: Ticket Class (1, 2, and 3),           1 = 1st, 2 = 2nd, 3 = 3rd
* Name: Basically Name
* Sex: Sex
* Age: Age
* SibSp: Number of Siblings or Spouse aboard
* Parch: Number of Parents or Children aboard
* Ticket: Ticket Number
* Fare: Passenger fare
* Cabin: Cabin number
* Embarked: Port of Embarkation (C, Q or S);        C = Cherboug, Q = Queenstown, S = Southampton

In [6]:
# C. look for missing values
data.isnull().sum()
data.isna().sum() / data.shape[0] * 100 # To find the percentage of the missing values

# If the column has just little missing values (Embarked), just get the rows with the NAN out. (Won't hurt the dataset much)
# If the column has too many missing values, just GET the whole column OUT (Best Practice)

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

As around 77% of `Cabin` are missing, so it's best to remove the entire column.

In [11]:
# Drop rows
data_cleaned = data.drop(columns = ['Cabin']) # inplace to make changes to the actual data (without creating a new DataFrame or assign to a new variable)
data_cleaned.shape

# data_cleaned.dropna(subset=['Cabin']) # remove rows with at least one missing value.
  # subset: to specify the column you want to dropna to!

(891, 11)

In [13]:
# Drop rows with at leasrt 1 missing value:
data_cleaned.dropna(inplace=True)
data_cleaned.shape

(712, 11)

In [14]:
# Check again, if there is any more null
data_cleaned.isnull().sum() / len(data) * 100

PassengerId    0.0
Survived       0.0
Pclass         0.0
Name           0.0
Sex            0.0
Age            0.0
SibSp          0.0
Parch          0.0
Ticket         0.0
Fare           0.0
Embarked       0.0
dtype: float64

-------

### **2.2. Single information**


**D.** How many male and female passengers were on the ship?

**E.** How many of them survived? How many didn't?

**F.** How many passengers were younger than 3 years old? How many were older than 60 years old?

**G.** How many passengers embarked from the three ports?

- `C`: Cherbourg, France.
- `Q`: Queentown, Ireland.
- `S`: Southampton, England.

**H.** How many passengers were in the 1st, 2nd and 3rd class?

In [15]:
# D. Male and female passengers aboard
data_cleaned['Sex'].value_counts()

Sex
male      453
female    259
Name: count, dtype: int64

In [18]:
# E. How many of them Survived?
data_cleaned['Survived'].value_counts()
data_cleaned['Survived'].value_counts(normalize=True) * 100
    # normalize=True shows percentage

alive = len(data_cleaned[data_cleaned['Survived'] == 1])
dead = len(data_cleaned[data_cleaned['Survived'] == 0])

print(f"There are {alive} alive, and {dead} dead people")

There are 288 alive, and 424 dead people

In [19]:
# F.How many passengers were younger than 3 years old? How many were older than 60 years old?\
data_cleaned['Age']

under_3 = data_cleaned[data_cleaned['Age'] < 3]
over_60 = data_cleaned[data_cleaned['Age'] > 60]

print(f"1. Under 3: {len(under_3)}\n2. Over 60: {len(over_60)}")

1. Under 3: 24
2. Over 60: 21

In [24]:
# orrrr, using .query
under_3_q = data_cleaned.query("Age < 3").shape[0]
over_60_q = data_cleaned.query("Age > 60").shape[0]

print(f"1. Under 3: {under_3_q}\n2. Over 60: {over_60_q}")

1. Under 3: 24
2. Over 60: 21

In [26]:
# G. passengers embarked from each of the three ports
data_cleaned['Embarked'].value_counts()

Embarked
S    554
C    130
Q     28
Name: count, dtype: int64

In [27]:
# H. passengers from each seat classes
data_cleaned['Pclass'].value_counts()

Pclass
3    355
1    184
2    173
Name: count, dtype: int64

-------------

### **2.3. Multiple information**

**I.** How many 1st class passengers survived? How about 2nd and 3rd class?

**J.** How many female passengers survived? How many males did?

**K.** How many people from each embarkation port survived?

**L.** Was `Jack` on the ship? How about `Rose`?

In [34]:
# To do
# I. Survived passengers from each of seat classes
survived_data = data_cleaned.copy()
survived_data['Survived'] = survived_data['Survived'].replace({0: 'Not Survied', 1: 'Survived'})
survived_data['Pclass'] = survived_data['Pclass'].replace({
    1: '1st Class',
    2: '2nd Class',
    3: '3rd Class'
})
    # Replacing value names, js for fun :)

survived_data.groupby(['Survived', 'Pclass']).size()

Survived     Pclass
Not Survied  1st Class     64
             2nd Class     90
             3rd Class    270
Survived     1st Class    120
             2nd Class     83
             3rd Class     85
dtype: int64

In [37]:
# J. Suvival Count by Gender
data_cleaned.groupby(['Survived', 'Sex']).size()

Survived  Sex
0         female     64
          male      360
1         female    195
          male       93
dtype: int64

In [38]:
# K. Survival Count by Port of Embarkment
data_cleaned.groupby(['Survived', 'Embarked']).size()

Survived  Embarked
0         C            51
          Q            20
          S           353
1         C            79
          Q             8
          S           201
dtype: int64

In [65]:
# L. Were 'Jack' and 'Rose' on the ship?
    # this shows names that contains '
# finding_jack_n_rose = data_cleaned[data_cleaned['Name'].str.lower().str.contains('jack') | data_cleaned['Name'].str.lower().str.contains('rose')]

    # or, shorter
    # | is part of regex, and case=False is to turn off case-sensitive (without having to .str.lower() every names)
# finding_jack_n_rose = data_cleaned[data_cleaned['Name'].str.contains('jack|rose', case=False)]

    # or, to find exactly 'Jack' and 'Rose'
    # \b:  zero-width non-word boundary; assertion that matches at a "word boundary"
        # basically, to find the exact word in between \b...\b, that stands on its own
finding_jack_n_rose_regex = data_cleaned[data_cleaned['Name'].str.contains(r'\bJack\b|\bRose\b')]

# finding_jack_n_rose
finding_jack_n_rose_regex

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Embarked]
Index: []

# **Further Reading**

- `Pandas` python library: https://pandas.pydata.org/docs/getting_started/index.html#getting-started

- `10 Minute to Pandas`: https://pandas.pydata.org/docs/user_guide/10min.html

- `Some Pandas Lession`: https://www.kaggle.com/learn/pandas

---------